/*******************Copyright(H)******************************************
********************杭州快电**********************************************
*-------------------文件信息----------------------------------------------
* FileName			: RTCTaskInterface.h
* Author			: 
* Date First Issued	: 
* Version			: 
* Description		: 
*-------------------历史版本信息------------------------------------------
* History		:
* Version		: 
* Description	:
*-------------------------------------------------------------------------
*************************************************************************/
#ifndef __RTCTASKINTERFACE_H_
#define __RTCTASKINTERFACE_H_
/* Includes-------------------------------------------------------------*/
#include "sysconfig.h"
#include "bsp_rtc.h"
/* Private define-----------------------------------------------------------------------------*/
/* Private typedef----------------------------------------------------------------------------*/
/* Private macro------------------------------------------------------------------------------*/

/* Private macro------------------------------------------------------------------------------*/

/* Private variables--------------------------------------------------------------------------*/

/* Private function prototypes----------------------------------------------------------------*/
#if (BSP_RTCENABLE > 0u)
/*****************************************************************************
* Function     : GetCurTime
* Description  : 获取当前RTC时间
* Input        : _BSPRTC_TIME* pTime  
* Output       : None
* Return       : 
* Note(s)      : 
* Contributor  : 2018年6月14日        
*****************************************************************************/
INT8U GetCurTime(_BSPRTC_TIME* pTime);

/*****************************************************************************
* Function     : GetCurUnixTimestamp
* Description  : 获取当前Uinx当前时间戳
* Input        : void  
* Output       : None
* Return       : 
* Note(s)      : 
* Contributor  : 2018年6月14日        
*****************************************************************************/
INT32U GetCurUnixTimestamp(void);

#endif //#if (BSP_RTCENABLE > 0u)

#endif //__RTCTASKINTERFACE_H_
/*********(H)COPYRIGHT 2018 杭州快电*****END OF FILE*********************/
