/*****************************************Copyright(C)******************************************
*******************************************杭州快电*********************************************
*------------------------------------------文件信息---------------------------------------------
* FileName			:SDMain.h
* Author			:
* Date First Issued	: 
* Version			: 
* Description		:
*----------------------------------------历史版本信息-------------------------------------------
* History			:
* Description		:
*-----------------------------------------------------------------------------------------------
***********************************************************************************************/
#ifndef __SDMAIN_H_
#define __SDMAIN_H_
/* Includes-----------------------------------------------------------------------------------*/
#include "sysconfig.h"
/* Private typedef----------------------------------------------------------------------------*/
typedef enum
{
	_NOINSEART = 0,     //SD卡未插入
	_INSEART,       //SD卡插入
}SDSTATUS;

typedef enum
{
	_RESET = 0,
	_SET = 1,
}SDVALUE;

typedef struct
{
	SDSTATUS SDstatus;               //SD卡状态
	SDVALUE  CreatCatalogSign;       //创建目录标识
	INT32U   SaveTradeNum;           //已保存交易记录条数
  INT32U   CurTradeNum;            //当前交易记录条数
	INT32U   NeedTradeNum;           //需要保存的交易记录条数
	INT32U   TotalSpace;             //SD卡总空间
	INT32U   SDUsedSpace;            //已使用SD卡空间
}SDSYSINFO;
/* extern variables--------------------------------------------------------------------------*/
extern OS_EVENT *SDEvent;               //SD卡事件控制块
extern SDSYSINFO SDInfo;
/* Private function prototypes----------------------------------------------------------------*/
/* Private functions--------------------------------------------------------------------------*/

#endif //__SDMAIN_H_
/************************(C)COPYRIGHT 2018 杭州快电*****END OF FILE****************************/



