/*****************************************Copyright(C)******************************************
*******************************************杭州汇誉*********************************************
*------------------------------------------文件信息---------------------------------------------
* FileName			: BSP_UART.c
* Author			: 
* Date First Issued	: 2018年6月21日
* Version			: 
* Description		: 
*----------------------------------------历史版本信息-------------------------------------------
* History			:
* //2010		: V
* Description		: 
*-----------------------------------------------------------------------------------------------
***********************************************************************************************/
/* Includes-----------------------------------------------------------------------------------*/
#ifndef  _APP_CONF_H_
#define	 _APP_CONF_H_
#include <stdio.h>
#include <string.h>
#include "sysconfig.h"
/* Private define-----------------------------------------------------------------------------*/
//===注释---选择继电器引脚不一样，PCU程序不一样.   其它的

#define USER_OLDandNEW		0			//1=是新板子      0=是老板子    【0】新旧板子选择（IO的区别）
#define USER_importand		1		    //1=非进口        0=进口芯片     【2】进口1200B与非进口
#define GZ485ban            1          // 1==官总电表485  0==莫总电表485  【4】电表485

//--------------【1】单双枪选择-----------------
#define USER_SINGLE_GUN		0			//单枪程序
#define USER_DOUBLE_GUN		1			//双枪程序
#define USER_GUN	USER_DOUBLE_GUN		//使用单枪程序还是双枪程序

//--------------【3】是否使用看门狗----------------
#define USER_dog		    1	  // 0==关闭看门狗     1==打开看门狗

//====版本号SYS_APP_VER
#define  	ENBLE_JG	    0   //0=否  1=是   使能精工---交流输入欠压去掉  增加功率动态调节   //是否使能精工？？？



typedef enum
{
	GUN_A = 0,
	GUN_B,
	GUN_MAX,
	GUN_UNDEFIN = 0X55,
}_GUN_NUM;

#define CARD_USER_CODE		0	//0表示刷卡不需要输入密码，1表示刷卡需要输入密码
/* Private typedef----------------------------------------------------------------------------*/
/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
/* Private function prototypes----------------------------------------------------------------*/
/* Private functions--------------------------------------------------------------------------*/
#endif

/************************(C)COPYRIGHT 2018 杭州汇誉*****END OF FILE****************************/
