/*****************************************Copyright(C)******************************************
*******************************************汇誉科技*********************************************
*------------------------------------------文件信息---------------------------------------------
* FileName          : __ADSAMPLEMAIN_H_.h
* Author            :
* Date First Issued :
* Version           : V
* Description       :
*----------------------------------------历史版本信息-------------------------------------------
* History           :
* //2010        : V
* Description       :
*-----------------------------------------------------------------------------------------------
***********************************************************************************************/
#ifndef __ADSAMPLEMAIN_H_
#define __ADSAMPLEMAIN_H_
/* Includes-----------------------------------------------------------------------------------*/
#include "sysconfig.h"
/* Private define-----------------------------------------------------------------------------*/
typedef struct
{
	INT32U  DC_HandVolt;    //握手电压(0.01)						
    INT32U  DC_OutVolt;     //输出电压(接触器后级电压)(0.01)
    INT32U  DC_GunT1Temp; //枪头温度
    INT32U  DC_GunT2Temp; //枪座温度
	INT32U 	JY_Vol;			//绝缘检测电压
} SYS_RemoteMeter;

//枪连接状态
typedef enum
{
    INTERFACE_UNKNOW = 0xE0,
    INTERFACE_UNCONNECTED ,
    INTERFACE_UNFULCONNECTED,
    INTERFACE_CONNECTED,
} _BSP_CHARGING_INTERFACE;

typedef struct
{
    INT8U EmergencyStop_sta: 1; //急停
    INT8U SurgeArrester_sta: 1; //防雷
    INT8U ChargDzLock_sta: 1;   //电磁锁状态
    INT8U AcContactor_sta: 1;   //交流接触器
    INT8U bit4: 1;              //
    INT8U bit5: 1;              //
    INT8U bit6: 1;              //
    INT8U BatReverse_sta: 1;    //输出防反,就是电池是否反接
} SYS_RemoteSignal;
/* Private typedef----------------------------------------------------------------------------*/

/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
/* Private function prototypes----------------------------------------------------------------*/
/***********************************************************************************************
* Function      : Get_TempAdjust
* Description   : 获取悬着
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT8U Get_TempAdjust(void);
/***********************************************************************************************
* Function      : Get_TempAdjust
* Description   : 温度校验模式选择
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
void Set_TempAdjust(INT8U dat);
/***********************************************************************************************
* Function      : GetRM_RemoteSignal
* Description   : 获取遥信
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
void GetRM_RemoteSignal(SYS_RemoteMeter *data);

/***********************************************************************************************
* Function      : GetRS_BatReverse
* Description   : 获取遥信
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT8U GetRS_BatReverse(INT8U gun);

/***********************************************************************************************
* Function      : Return_HandSta
* Description   : 握手状态
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT8U Return_HandSta(INT8U gun);
/***********************************************************************************************
* Function      : GetRS_DCOutVolt
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRS_DCOutVolt(void);
/***********************************************************************************************
* Function      : GetRS_DCOutCurr
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRS_DCOutCurr(void);
/***********************************************************************************************
* Function      : GetRS_HandVolt
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT8U GetRS_HandVolt(void);
/***********************************************************************************************
* Function      : GetRS_GunTailTemp
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRS_GunTailTemp(void);
/***********************************************************************************************
* Function      : GetRS_GunHeadTemp
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRS_GunHeadTemp(void);
/***********************************************************************************************
* Function      : GetRS_BATVolt
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRS_BATVolt(void);
/***********************************************************************************************
* Function      : GetRS_SYSINVolt
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRS_SYSINVolt(void);

/***********************************************************************************************
* Function      : GetYC_DC_OutVolt
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRM_DCOutVolt(INT8U gun);


/***********************************************************************************************
* Function      : GetJY_DCOutVolt
* Description   : 获取绝缘缘检测电压
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020-7-16  叶喜雨
***********************************************************************************************/
INT32U GetJY_DCOutVolt(INT8U gun);

/***********************************************************************************************
* Function      : GetYC_HandVolt
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT8U GetRM_HandVolt(INT8U gun);
/***********************************************************************************************
* Function      : GetYC_GunTailTemp
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRM_GunT1Temp(_GUN_NUM gun);
/***********************************************************************************************
* Function      : GetYC_GunHeadTemp
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRM_GunT2Temp(_GUN_NUM gun);
/***********************************************************************************************
* Function      : GetYC_BATVolt
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRM_BATVolt(void);
/***********************************************************************************************
* Function      : GetYC_SYSINVolt
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
INT32U GetRM_SYSINVolt(void);
/***********************************************************************************************
* Function      : GetYC_SYSINVolt
* Description   : 获取遥测
* Input         :
* Output        :
* Note(s)       :
* Contributor   : 2020/07/16 叶喜雨
***********************************************************************************************/
void RMRealTime_Check(void);
/* Private functions--------------------------------------------------------------------------*/

#endif  //__ADSAMPLEMAIN_H_
/************************(C)COPYRIGHT 2020 汇誉科技*****END OF FILE****************************/
