/*****************************************Copyright(C)******************************************
*******************************************杭州汇誉*********************************************
*------------------------------------------文件信息---------------------------------------------
* FileName			: Display.h
* Author			: 
* Date First Issued	:
* Version			: 
* Description		: 
*----------------------------------------历史版本信息-------------------------------------------
* History			:
* Description		: 
*-----------------------------------------------------------------------------------------------
***********************************************************************************************/
#ifndef	__DISPLAY_H_
#define	__DISPLAY_H_
/* Includes-----------------------------------------------------------------------------------*/
#include "sysconfig.h"
#include "DispKey.h"
/* Private define-----------------------------------------------------------------------------*/
#define DISPLAY_UART               USART1      //显示任务串口号
#define MENU_TIMEOUT_FRAME_LEN     (65u)        //页面超时表格长度
/* Private typedef----------------------------------------------------------------------------*/
/*下面结构中对于Menu_pValue中的数值会实时更新的情况，还需实时监视这些值是否变化
有变化则及时刷新页面 */
/*-----菜单结构-----------------*/
typedef struct st_menu
{
    struct st_menu* Menu_PrePage;                     		//指上一级菜单   
    const int FrameID;                                      //当前画面ID,通常为图片ID号 （切换页面）
    void (*function2)(_LCD_KEYVALUE *keyval);               //当前画面的按键处理
    void (*function3)(void);                                //当前画面变量显示函数
    INT16U CountDown;										//当前页面页面倒计时时间 0表示不需要倒计时	
}ST_Menu;
/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
#endif	//__DISPLAY_H_
/************************(C)COPYRIGHT 2018 杭州汇誉*****END OF FILE****************************/
