/*****************************************Copyright(C)******************************************
*******************************************杭州快电*********************************************
**-----------------------------------------文件信息---------------------------------------------
**文    件    名: 
**创    建    人: 
**创  建  日  期: 
**最  新  版  本: 
**描          述: 
**---------------------------------------历史版本信息-------------------------------------------
**修    改    人: 
**日          期: 
**版          本: 
**描          述:
**----------------------------------------------------------------------------------------------
***********************************************************************************************/
/* Includes-----------------------------------------------------------------------------------*/
#include	"sysconfig.h"
#include	"bsp_WDG.h"
/* Private define-----------------------------------------------------------------------------*/
// 引脚定义
#define	WDG_GPIO_CTLR			GPIOH			// 控制脚
#define WDG_GPIO_CTLR_WDI		BIT(15)			// 喂狗
/* Private typedef----------------------------------------------------------------------------*/
/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
/* Private function prototypes----------------------------------------------------------------*/
/* Private functions--------------------------------------------------------------------------*/
/***********************************************************************************************
* Function		: BSP_WDGFeedDog
* Description	: 喂狗程序,这里对喂狗脚输出反向
* Input			: 
* Output		: 
* Note(s)		: 外部IMP706看门狗,1.6s喂狗时间,上升沿或者下降沿都可以.
* Contributor	: 2018年7月11日
***********************************************************************************************/
void BSP_WDGFeedDog(void)
{
	if(GPIO_ReadOutputDataBit(WDG_GPIO_CTLR,WDG_GPIO_CTLR_WDI)== Bit_SET)
		GPIO_WriteBit(WDG_GPIO_CTLR,WDG_GPIO_CTLR_WDI,Bit_RESET);
	else
		GPIO_WriteBit(WDG_GPIO_CTLR,WDG_GPIO_CTLR_WDI,Bit_SET);
}
/***********************************************************************************************
* Function		: BSP_WDGInit
* Description	: 初始化
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2018年7月11日
***********************************************************************************************/
void BSP_WDGInit(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	RCC_APB1PeriphClockCmd(RCC_AHB1Periph_GPIOH, ENABLE);
	
	// 控制引脚初始化
				/*设置引脚模式为输出模式*/
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;   
    
    /*设置引脚的输出类型为推挽输出*/
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    
    /*设置引脚为上拉模式*/
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;

		/*设置引脚速率为2MHz */   
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = WDG_GPIO_CTLR_WDI;
	GPIO_Init(WDG_GPIO_CTLR, &GPIO_InitStructure);
}
/************************(C)COPYRIGHT 2018 杭州快电*****END OF FILE****************************/
