/*****************************************Copyright(C)******************************************
*******************************************汇誉科技*********************************************
**-----------------------------------------文件信息---------------------------------------------
**文    件    名: bsp_RLC.h
**硬          件: STM32
**创    建    人: 
**创  建  日  期: 2018年7月5日 
**最  新  版  本: V0.1
**描          述: RLC的头文件  改成统一输出格式
**---------------------------------------历史版本信息-------------------------------------------
**修    改    人: 
**日          期: 
**版          本: 
**描          述: 
**----------------------------------------------------------------------------------------------
***********************************************************************************************/
#ifndef	__BSP_IO_H_
#define	__BSP_IO_H_
#include "os_cpu.h"
/* Includes-----------------------------------------------------------------------------------*/
/* Private define-----------------------------------------------------------------------------*/
typedef enum
{
	IO_RLY_FAN = 0,				//风扇
	IO_RLY_K1K2A,				//A枪K1
	IO_RLY_LOCKA,			 //A枪电子锁
	IO_RLY_BMSPOWERA, 	    //A枪辅助电源
	IO_RLY_K3,				//交流输入接触器
	
	IO_RLY_RES1,				//备用
	IO_RLY_LOCKB,			//B枪电子锁
	IO_RLY_BMSPOWERB, 		//B枪辅助电源
	IO_RLY_K1K2B, 			//B枪K1
	IO_RLY_K2,				//母联
	
	IO_LEDA_G,				//A枪绿灯
	IO_LEDA_R,				//A枪红灯
	IO_LEDA_Y,				//A枪黄灯
	IO_LEDB_G,				//B枪绿灯
	IO_LEDB_R,				//B枪红灯
	
	IO_LEDB_Y,				//B枪黄灯
	IO_LED_RUN,				//运行灯
	IO_LED_BEEP,			//蜂鸣器
	IO_JY_PGA,				//绝缘
	IO_JY_NGA,		
	
	IO_JY_PGB,				//绝缘
	IO_JY_NGB,				
    IO_4G_PWR,  
	IO_4G_RES,
	IO_4G_ONOFF,
	
	
	
	IO_PRINTF_485,		//485打印串口使能
	IO_MAX
}_BSPIO_TABLE_NUM;


//这3个ID需要根据状态判断是否位故障  SWDC_A_State   为实际状态0为断开，1为闭合    SWDC_A,0 为正常 1为异常
typedef struct
{
	INT8U SWDC_A_State; //实际状态
	INT8U SWDC_B_State;	
	INT8U QDC_State;
	
	INT8U SWDC_A;
	INT8U SWDC_B;
	INT8U QDC;
}_MSP_DI;
// 状态类型,一般用于位控制
#define	BSP_STATE_RESET			  0u				// 清0
#define	BSP_STATE_SET			  1u				// 置1
#define	BSP_STATE_OVERTURN		  2u				// 翻转

typedef enum
{
	BSPRLC_STATE_CLOSE = BSP_STATE_SET,			// LED开
	BSPRLC_STATE_OPEN = BSP_STATE_RESET,		// LED关
	BSPRLC_STATE_OVERTURN = BSP_STATE_OVERTURN,	// LED翻转
}_BSPRLC_STATE;

/* Private typedef----------------------------------------------------------------------------*/
/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
/* Private function prototypes----------------------------------------------------------------*/
/* Private functions--------------------------------------------------------------------------*/

/***********************************************************************************************
* Function		: BSP_RLCEnable
* Description	: 继电器使能,禁止
* Input			: state:输出状态_BSPRLC_STATE
				  	BSPRLC_STATE_CLOSE		关
					BSPRLC_STATE_OPEN		开
* Output		: 
* Note(s)		: 
* Contributor	: 2018年7月5日
***********************************************************************************************/
void BSP_RLCEnable(_BSPRLC_STATE state);
/***********************************************************************************************
* Function		: BSP_RLCWrite
* Description	: 继电器控制。
* Input			: num:继电器号(0 ~ BSPRLC_MAX_NUM-1)
				  state:输出状态_BSPRLC_STATE
				  	BSPRLC_STATE_CLOSE		关
					BSPRLC_STATE_OPEN		开
					BSPRLC_STATE_OVERTURN	翻转
* Output		: 
* Note(s)		: 
* Contributor	: 2018年7月5日
***********************************************************************************************/
void BSP_IOClose(INT8U num);					// 关
void BSP_IOOpen(INT8U num);					// 开
void BSP_IOTurnover(INT8U num);				// 翻转
void BSP_RLCWrite(INT8U num,_BSPRLC_STATE state);


//
/***********************************************************************************************
* Function		: BSP_OpenLOCK
* Description	: 打开电子锁
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_OpenLOCK(INT8U gun);

/***********************************************************************************************
* Function		: BSP_CloseLOCK
* Description	: 关闭电子锁
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_CloseLOCK(INT8U gun);
/***********************************************************************************************
* Function		: BSP_RLCInit
* Description	: 驱动初始化
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2018年7月5日
***********************************************************************************************/
void BSP_IOInit(void);

/***********************************************************************************************
* Function		: BSP_GetIOState
* Description	: 获取IO当前状态   （写入的时候置状态）			 
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
INT8U BSP_GetIOState(INT8U num);

/***********************************************************************************************
* Function		: BSP_OpenBMSPower
* Description	: 打开辅助电源
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_OpenBMSPower(INT8U gun);

/***********************************************************************************************
* Function		: BSP_OpenBMSPower
* Description	: 关闭辅助电源
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_CloseBMSPower(INT8U gun);

/***********************************************************************************************
* Function		: BSP_OpenBMSPower
* Description	: 打开运行灯
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_OpenRunLed(INT8U gun);

/***********************************************************************************************
* Function		: BSP_OpenBMSPower
* Description	: 关闭运行灯
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_CloseRunLed(INT8U gun);

/***********************************************************************************************
* Function		: BSP_OpenBMSPower
* Description	: 打开故障灯
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_OpenFailLed(INT8U gun);

/***********************************************************************************************
* Function		: BSP_OpenBMSPower
* Description	: 关闭故障灯
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_CloseFailLed(INT8U gun);

/***********************************************************************************************
* Function		: BSP_OpenBMSPower
* Description	: 打开告警灯
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_OpenWarnLed(INT8U gun);

/***********************************************************************************************
* Function		: BSP_OpenBMSPower
* Description	: 关闭告警灯
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_CloseWarnLed(INT8U gun);

/***********************************************************************************************
* Function		: BSP_OpenBMSPower
* Description	: 打开K1K2
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_OpenK1K2(INT8U gun);

/***********************************************************************************************
* Function		: BSP_OpenBMSPower
* Description	: 关闭K1K2
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_CloseK1K2(INT8U gun);


/***********************************************************************************************
* Function		: BSP_OpenPG1
* Description	: 绝缘检测
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_OpenPG1(INT8U gun);
/***********************************************************************************************
* Function		: BSP_ClosePG1
* Description	:  绝缘检测
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_ClosePG1(INT8U gun);

/***********************************************************************************************
* Function		: BSP_OpenNG2
* Description	: 绝缘检测
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_OpenNG2(INT8U gun);
/***********************************************************************************************
* Function		: BSP_CloseNG2
* Description	:  绝缘检测
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2021年7月14日
***********************************************************************************************/
void BSP_CloseNG2(INT8U gun);

#endif	//__BSP_RLC_H_
/************************(C)COPYRIGHT 2018 汇誉科技*****END OF FILE****************************/
