/*****************************************Copyright(C)******************************************
*******************************************æ­å·å¿«ç”µ*********************************************
*------------------------------------------æ–‡ä»¶ä¿¡æ¯---------------------------------------------
* FileName			: bsp_MPulse.h
* Author			: 
* Date First Issued	:    
* Version			: 
* Description		: 
*----------------------------------------å†å²ç‰ˆæœ¬ä¿¡æ¯-------------------------------------------
* History			: 
* Description		: 
*-----------------------------------------------------------------------------------------------*/
#ifndef	__BSP_MPULSE_H_
#define	__BSP_MPULSE_H_
#include "app_conf.h"
/* Includes-----------------------------------------------------------------------------------*/
/* Private define-----------------------------------------------------------------------------*/
typedef enum
{
	#if ENBLE_JG
	#if (USER_GUN == USER_SINGLE_GUN)
	BSP_DI_JT = 0,			//¼±Í£
	BSP_DI_QGW,				//AÇ¹¹éÎ»
	BSP_DI_DOOR,			//ÃÅ½û
	BSP_DI_W,				//Ë®½ş
	BSP_DI_ACSW,			//½»Á÷½Ó´¥Æ÷
	BSP_DI_QX,				//·ÀÇãĞ±
	BSP_DI_DCSWA,			//AÇ¹Ö±Á÷½Ó´¥Æ÷
	BSP_DI_DCSWB,			//BÇ¹Ö±Á÷½Ó´¥Æ÷
	BSP_DI_LOCKA,				//Ç¹Ëø
	BSP_DI_RES,				//BÇ¹¹éÎ»
	BSP_DI_MAX,
	#else
	BSP_DI_JT = 0,			//¼±Í£
	BSP_DI_QGW,				//AÇ¹¹éÎ»
	BSP_DI_DOOR,			//ÃÅ½û
	BSP_DI_W,				//Ë®½ş
	BSP_DI_ACSW,			//½»Á÷½Ó´¥Æ÷
	BSP_DI_QX,				//·ÀÇãĞ±
	BSP_DI_DCSWA,			//AÇ¹Ö±Á÷½Ó´¥Æ÷
	BSP_DI_DCSWB,			//BÇ¹Ö±Á÷½Ó´¥Æ÷
	BSP_DI_QSW,				//ÇÅ½Ó½Ó´¥Æ÷
	BSP_DI_RES,				//BÇ¹¹éÎ»
	BSP_DI_MAX,
	#endif
	#else
	BSP_DI_JT = 0,			//¼±Í£
	BSP_DI_FD,				//·ÀÀ×
	BSP_DI_DOOR,			//ÃÅ½û
	BSP_DI_ACSW,			//½»Á÷¿Õ¿ª
	BSP_DI_DCSW,			//Ö±Á÷½Ó´¥Æ÷
	BSP_DI_RES,				//±¸ÓÃ
	BSP_DI_LOCKA,			//Ç¹ËøA
	BSP_DI_LOCKB,			//Ç¹ËøB
	BSP_DI_BMSPOWERA,		//bms¸¨ÖúµçÔ´A
	BSP_DI_BMSPOWERB,		//bms¸¨ÖúµçÔ´B
	BSP_DI_MAX,
	#endif
}_BSP_DI_NUM;

/* Private typedef----------------------------------------------------------------------------*/
/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
/* Private function prototypes----------------------------------------------------------------*/
/* Private functions--------------------------------------------------------------------------*/
/***********************************************************************************************
* Function		: BSP_MPLSScan
* Description	:
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2018å¹´7æœˆ25æ—¥
***********************************************************************************************/
void BSP_MPLSScan(void);
/***********************************************************************************************
* Function		: BSP_MPLSReset
* Description	: ¸´Î»Ä³¸öÂö³å,ÇåÁãÂö³å¼ÆÊıÆ÷µÄÖµ
* Input			: num:Âö³åÉè±¸ºÅ(0 ~ BSP_YX_MAX-1)
* Output		: 
* Note(s)		: 
* Contributor	: 2018å¹´7æœˆ25æ—¥
***********************************************************************************************/
void BSP_MPLSReset(INT8U num);
/***********************************************************************************************
* Function		: BSP_MPLSClear
* Description	: ÇåÁãÂö³å¼ÆÊıÆ÷µÄÖµ
* Input			: num:Âö³åÉè±¸ºÅ(0 ~ BSP_YX_MAX-1)
* Output		: 
* Note(s)		: 
* Contributor	: 2018å¹´7æœˆ25æ—¥
***********************************************************************************************/
void BSP_MPLSClear(INT8U num);
/***********************************************************************************************
* Function		: BSP_MPLSRead
* Description	: ¶ÁÈ¡Âö³åÖµ,ÓÃ»§Í¨¹ı´Ë³ÌĞòµÃµ½Ä³¸öÂö³åÉè±¸µÄÂö³å¼ÆÊıÖµ
* Input			: num:Âö³åÉè±¸ºÅ(0 ~ BSP_YX_MAX-1)
* Output		: Âö³åÖµ
* Note(s)		: 
* Contributor	: 2018å¹´7æœˆ25æ—¥
***********************************************************************************************/
INT16U BSP_MPLSRead(INT8U num); //¶ÔÂö³åĞÍĞÅºÅµÄ»ñÈ¡£¬¿É»ñÈ¡Âö³å¸öÊı
INT8U BSP_MPLSState(INT8U num); //¶ÔÒ£ĞÅÀà×´Ì¬ĞÅºÅµÄ»ñÈ¡º¯Êı£¬·µ»Ø×´Ì¬Öµ
/***********************************************************************************************
* Function		: BSP_MPLSInit
* Description	: ³õÊ¼»¯,³õÊ¼»¯²ÎÊı,ÅäÖÃÒı½Å
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 2018å¹´7æœˆ25æ—¥
***********************************************************************************************/
void BSP_MPLSInit(void);

/***********************************************************************************************
* Function		: BSP_GetJTState
* Description	: »ñÈ¡µç×ÓËø×´Ì¬
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	:20210719
***********************************************************************************************/
INT8U BSP_GetLockState(INT8U gun);
#endif	//__BSP_MPULSE_H_
/************************(C)COPYRIGHT 2018 æ­å·å¿«ç”µ*****END OF FILE****************************/
