/*****************************************Copyright(H)******************************************
*******************************************汇誉科技*********************************************
*------------------------------------------文件信息---------------------------------------------
* FileName			: connectbmsframe.h
* Author			  :      
* Date First Issued	: 10/6/2015
* Version			  : V0.1
* Description		: 
*----------------------------------------历史版本信息-------------------------------------------
* History			  :
* //2010		    : V
* Description		: 
*-----------------------------------------------------------------------------------------------
***********************************************************************************************/
#ifndef	__CONNECT_BMS_FRAME_H_
#define	__CONNECT_BMS_FRAME_H_
/* Includes-----------------------------------------------------------------------------------*/
/* Private define-----------------------------------------------------------------------------*/  
#define APP_BMS_DEFAULT     0x00     //BMS不能辨识,也做初始值用
#define APP_BMS_CHECKED     0xAA     //BMS能辨识
/* Private typedef----------------------------------------------------------------------------*/
/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
/* Private function prototypes----------------------------------------------------------------*/
/* Private functions--------------------------------------------------------------------------*/
/* Private macro------------------------------------------------------------------------------*/
/* Private variables--------------------------------------------------------------------------*/
/***********************************************************************************************
* Function		: Reply_BMSFrame_CTS
* Description	: 回复BMS的RTS的回复帧CTS
* Input			: 
* Return		: 
* Note(s)		: 该CTS区别与充电握手配置阶段的CTS，该CTS为J1939协议的多帧处理里的回复RTS的CTS
* Contributor	: 160523	叶喜雨
***********************************************************************************************/
void Reply_BMSFrame_CTSA(void);
/***********************************************************************************************
* Function		: Reply_BMSFrame_CTS
* Description	: 回复BMS的RTS的回复帧CTS
* Input			: 
* Return		: 
* Note(s)		: 该CTS区别与充电握手配置阶段的CTS，该CTS为J1939协议的多帧处理里的回复RTS的CTS
* Contributor	: 160523	叶喜雨
***********************************************************************************************/
void Reply_BMSFrame_CTSB(void);
/***********************************************************************************************
* Function		: Reply_TPCM_EndofMsgAckFrame
* Description	: 发送充电机辨识报文
* Input			: 
* Output		: 
* Note(s)		: CRM报文，PGN=256 P=6
* Contributor	: 20101210          
***********************************************************************************************/
void Reply_TPCM_EndofMsgAckFrameA(void);
/***********************************************************************************************
* Function		: Reply_TPCM_EndofMsgAckFrame
* Description	: 发送充电机辨识报文
* Input			: 
* Output		: 
* Note(s)		: CRM报文，PGN=256 P=6
* Contributor	: 20101210          
***********************************************************************************************/
void Reply_TPCM_EndofMsgAckFrameB(void);
/***********************************************************************************************
* Function		: CRM_SendShakeHandIdentifyFrame
* Description	: 发送充电机辨识报文
* Input			: 
* Output		: 
* Note(s)		: CRM报文，PGN=256 P=6
* Contributor	: 20101210          
***********************************************************************************************/
void CRM_SendShakeHandIdentifyFrameA(void);
/***********************************************************************************************
* Function		: CRM_SendShakeHandIdentifyFrame
* Description	: 发送充电机辨识报文
* Input			: 
* Output		: 
* Note(s)		: CRM报文，PGN=256 P=6
* Contributor	: 20101210          
***********************************************************************************************/
void CRM_SendShakeHandIdentifyFrameB(void);
/***********************************************************************************************
* Function		: CHM_SendShakeHandFrame
* Description	: 发送充电机辨识报文
* Input			: 
* Output		: 
* Note(s)		: CHM报文，PGN=9278 P=6
* Contributor	: 20160524        
***********************************************************************************************/
void CHM_SendShakeHandFrameA(void);
/***********************************************************************************************
* Function		: CHM_SendShakeHandFrame
* Description	: 发送充电机辨识报文
* Input			: 
* Output		: 
* Note(s)		: CHM报文，PGN=9278 P=6
* Contributor	: 20160524        
***********************************************************************************************/
void CHM_SendShakeHandFrameB(void);
/***********************************************************************************************
* Function		: CTS_SendSynTimeMessage
* Description	: 发送时间同步信息
* Input			: 
* Output		: 
* Note(s)		: CTS报文，PGN=1792 P=6
* Contributor	: 20160524        
***********************************************************************************************/
void CTS_SendSynTimeMessageA(void);

/***********************************************************************************************
* Function		: CTS_SendSynTimeMessage
* Description	: 发送时间同步信息
* Input			: 
* Output		: 
* Note(s)		: CTS报文，PGN=1792 P=6
* Contributor	: 20160524        
***********************************************************************************************/
void CTS_SendSynTimeMessageB(void);
/***********************************************************************************************
* Function		: CML_SendMaxVolandCur
* Description	: 发送时间同步信息
* Input			: 
* Output		: 
* Note(s)		: CML报文，PGN=2048 P=6
* Contributor	: 20160524        
***********************************************************************************************/
void CML_SendMaxVolandCurA(void);

/***********************************************************************************************
* Function		: CML_SendMaxVolandCur
* Description	: 发送时间同步信息
* Input			: 
* Output		: 
* Note(s)		: CML报文，PGN=2048 P=6
* Contributor	: 20160524        
***********************************************************************************************/
void CML_SendMaxVolandCurB(void);
/***********************************************************************************************
* Function		: CRO_SendChargeDevUnstandby
* Description	: 发送CRO(0x00)报文
* Input			: 
* Output		: 
* Note(s)		: Cro报文，PGN=2560 P=4
* Contributor	: 20160524        
***********************************************************************************************/
void CRO_SendChargeDevUnstandbyA(void);
/***********************************************************************************************
* Function		: CRO_SendChargeDevUnstandby
* Description	: 发送CRO(0x00)报文
* Input			: 
* Output		: 
* Note(s)		: Cro报文，PGN=2560 P=4
* Contributor	: 20160524        
***********************************************************************************************/
void CRO_SendChargeDevUnstandbyB(void);
/***********************************************************************************************
* Function		: CRO_SendChargeDevStandby
* Description	: 发送时间同步信息
* Input			: 
* Output		: 
* Note(s)		: Cro报文，PGN=2560 P=4
* Contributor	: 20160524        
***********************************************************************************************/
void CRO_SendChargeDevStandbyA(void);
/***********************************************************************************************
* Function		: CRO_SendChargeDevStandby
* Description	: 发送时间同步信息
* Input			: 
* Output		: 
* Note(s)		: Cro报文，PGN=2560 P=4
* Contributor	: 20160524        
***********************************************************************************************/
void CRO_SendChargeDevStandbyB(void);
/***********************************************************************************************
* Function		: CCS_DeviceChargeState
* Description	: 发送时间同步信息
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 20160524        
***********************************************************************************************/
void CCS_DeviceChargeStateA(void);
/***********************************************************************************************
* Function		: CCS_DeviceChargeState
* Description	: 发送时间同步信息
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 20160524        
***********************************************************************************************/
void CCS_DeviceChargeStateB(void);
void CST_DeviceEndChargeA(void);
void CST_DeviceEndChargeB(void);
/***********************************************************************************************
* Function		: CSD_DeviceChargeEndStatistics
* Description	: 
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 20160524        
***********************************************************************************************/
void CSD_DeviceChargeEndStatisticsA(void);
/***********************************************************************************************
* Function		: CSD_DeviceChargeEndStatistics
* Description	: 
* Input			: 
* Output		: 
* Note(s)		: 
* Contributor	: 20160524        
***********************************************************************************************/
void CSD_DeviceChargeEndStatisticsB(void);
/*****************************************************************************
* Function      : CEM_DeviceChargeErr
* Description   : CEM报文发送
* Input         : void  
* Output        : None
* Note(s)       : 
* Contributor   : 2016年6月6日  叶喜雨
*****************************************************************************/
void CEM_DeviceChargeErrA(void);


/*****************************************************************************
* Function      : CEM_DeviceChargeErr
* Description   : CEM报文发送
* Input         : void  
* Output        : None
* Note(s)       : 
* Contributor   : 2016年6月6日  叶喜雨
*****************************************************************************/
void CEM_DeviceChargeErrB(void);
#endif //__CONNECT_BMS_FRAME_H_
/************************(H)COPYRIGHT 2010 汇誉科技*****END OF FILE****************************/
